# 1. Посчитайте сумму чисел.
# • Создать цикл while от 1 до 1000;
# • Суммировать числа в диапазоне и записать в переменную;
# • Вывести сумму чисел.
# yuy = 0
# while yuy < 1000:
#     yuy =yuy+ 1  
#     print(yuy)
# 2. Вывести значение переменной а.
# • Попросить пользователя ввести значение переменной a (a < 1000).
# • Написать условие цикла так, чтобы цикл работал пока переменная
# меньше 1000 (до 1000);
# • Шаг цикла должен составлять 3;
# • При каждой итерации выводить значение a.
a = 0
while a < 1000:
    a =a+ 1  
    print(a)
print("a")
# 3. Вывести ряд чисел до определенного условия.
# • Попросить пользователя ввести два числа;
# • Написать условие цикла так, чтобы он работал пока одна
# переменная не станет равной другой;
# • Каждую итерацию уменьшать значение большей переменной на 1.
# Используйте все знания, которые вы получили на первом уроке. Удачи!

