# 1. Вывести числа в диапазоне.
# • Попросить пользователя ввести число N (N>0)
# • Открыть цикл for для чисел от N до 0;
# • Вывести каждое число в диапазоне при помощи оператора print.

# s = int(input("Write a number:"))
# for i in range (s ,0,-1):
#     print(i)
# 2. Вывести нечетные числа в определенном диапазоне.
# • Создать цикл в диапазоне от 1 до 100;
# • Проверить каждое число в диапазоне на условие нечетности;
# • Вывести только нечетные числа при помощи оператора print.
# for q in range(1,101):
#     if q % 2 != 0:
#         print(q)


# 3. Вычислите сумму чисел.
# • Попросить пользователя ввести два числа (A, B);
# • Создать цикл в диапазоне от A до B;
# • Суммировать числа в диапазоне и записать в переменную.
# • Вывести сумму чисел.

# a = int(input("Write A number:"))
# b = int(input("Write B number:"))
# for y in range (0, 1):
#     print("Answer:",a+b)